#### DetailElementOrderUtils Members

---

|  |
| --- |
| DetailElementOrderUtils Class   Methods   See Also |

The  DetailElementOrderUtils  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | AreDetailElements | Indicates whether the given elements are all detail elements. |
| Public method Static member | BringForward(Document, View, ElementId) | Moves the given detail instance one step closer to the front of all other detail instances in the view. |
| Public method Static member | BringForward(Document, View, ICollection ElementId ) | Moves the given detail instances one step closer to the front of all other detail instances in the view, while keeping the order of the given ones. |
| Public method Static member | BringToFront(Document, View, ElementId) | Places the given detail instance in the front of all other detail instances in the view. |
| Public method Static member | BringToFront(Document, View, ICollection ElementId ) | Places the given detail instances in the front of all other detail instances in the view, while keeping the order of the given ones. |
| Public method Static member | IsDetailElement | Indicates if the given element is a detail element. |
| Public method Static member | SendBackward(Document, View, ElementId) | Moves the given detail instance one step closer to the back of all other detail instances in the view. |
| Public method Static member | SendBackward(Document, View, ICollection ElementId ) | Moves the given detail instances one step closer to the back with relation to all other detail instances in the view, while keeping the order of the given ones. |
| Public method Static member | SendToBack(Document, View, ElementId) | Places the given detail instance behind all detail instances in the view. |
| Public method Static member | SendToBack(Document, View, ICollection ElementId ) | Places the given detail instances behind all other detail instances in the view, while keeping the order of the given ones. |

# See Also

DetailElementOrderUtils Class

Autodesk.Revit.DB Namespace